TakeshiShiode/sample_cq_interface2023/qemu-6.0.0/hw/rx/rx24t.c
/*
 * RX24T Microcontroller
 *
 * Datasheet: RX24T Group, RX241 Group User's Manual: Hardware
 * (Rev.1.40 R01UH0033EJ0140)
 *
 * Copyright (c) 2019 Yoshinori Sato
 * Copyright (c) 2020 Philippe Mathieu-Daudé
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms and conditions of the GNU General Public License,
 * version 2 or later, as published by the Free Software Foundation.
 *
 * This program is distributed in the hope it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "qemu/error-report.h"
#include "hw/hw.h"
#include "hw/rx/rx24t.h"
#include "hw/loader.h"
#include "hw/sysbus.h"
#include "hw/qdev-properties.h"
#include "sysemu/sysemu.h"
#include "cpu.h"
#include "qom/object.h"

/*
 * RX24T Internal Memory
 */
#define RX24T_IRAM_BASE     0x00000000
#define RX24T_DFLASH_BASE   0x00100000
#define RX24T_CFLASH_BASE   0xfff80000


/*
 * RX24T Peripheral Address
 * See users manual section 5
 */
#define RX24T_SYSTEM_BASE  0x00080000
#define RX24T_ICU_BASE  0x00087000
#define RX24T_TMR_BASE  0x00088200
#define RX24T_CMT_BASE  0x00088000
#define RX24T_SCI_BASE  0x00088240
#define RX24T_MTU0BASE 0x000C1300
#define RX24T_MTU1BASE 0x000C1380
#define RX24T_MTU2BASE 0x000C1400
#define RX24T_MTU34BASE 0x000C1200
#define RX24T_MTU5BASE 0x000C1C80
#define RX24T_MTU67BASE 0x000C1A00
#define RX24T_S12ADBASE 0x00089000
#define RX24T_IOPORTBASE 0x0008C000
#define RX24T_KEYTESTBASE 	0x000FFD00

/*
 * RX24T Peripheral IRQ
 * See users manual section 11
 */
#define RX24T_TMR_IRQ   174
#define RX24T_CMT_IRQ   28
#define RX24T_SCI_IRQ   214

#define RX24T_XTAL_MIN_HZ  (8 * 1000 * 1000)
#define RX24T_XTAL_MAX_HZ (14 * 1000 * 1000)
#define RX24T_PCLK_MAX_HZ (50 * 1000 * 1000)

struct RX24TClass {
    /*< private >*/
    DeviceClass parent_class;
    /*< public >*/
    const char *name;
    uint64_t ram_size;
    uint64_t rom_flash_size;
    uint64_t data_flash_size;
};
typedef struct RX24TClass RX24TClass;

DECLARE_CLASS_CHECKERS(RX24TClass, RX24T_MCU,
                       TYPE_RX24T_MCU)

/*
 * IRQ -> IPR mapping table
 * 0x00 - 0x91: IPR no (IPR00 to IPR91)
 * 0xff: IPR not assigned
 * See "11.3.1 Interrupt Vector Table" in hardware manual.
 */
static const uint8_t ipr_table[NR_IRQS] = {
    0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
    0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, /* 15 */
    0x00, 0xff, 0xff, 0xff, 0xff, 0x01, 0xff, 0x02,
    0xff, 0xff, 0xff, 0x03, 0x04, 0x05, 0x06, 0x07, /* 31 */
    0x08, 0x09, 0x0a, 0x0b, 0x0c, 0x0d, 0x0e, 0x0f,
    0x10, 0x11, 0x12, 0x13, 0x14, 0x14, 0x14, 0x14, /* 47 */
    0x15, 0x15, 0x15, 0x15, 0xff, 0xff, 0xff, 0xff,
    0x18, 0x18, 0x18, 0x18, 0x18, 0x1d, 0x1e, 0x1f, /* 63 */
    0x20, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27,
    0x28, 0x29, 0x2a, 0x2b, 0x2c, 0x2d, 0x2e, 0x2f, /* 79 */
    0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
    0xff, 0xff, 0x3a, 0x3b, 0x3c, 0xff, 0xff, 0xff, /* 95 */
    0x40, 0xff, 0x44, 0x45, 0xff, 0xff, 0x48, 0xff,
    0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, /* 111 */
    0xff, 0xff, 0x51, 0x51, 0x51, 0x51, 0x52, 0x52,
    0x52, 0x53, 0x53, 0x54, 0x54, 0x55, 0x55, 0x56, /* 127 */
    0x56, 0x57, 0x57, 0x57, 0x57, 0x58, 0x59, 0x59,
    0x59, 0x59, 0x5a, 0x5b, 0x5b, 0x5b, 0x5c, 0x5c, /* 143 */
    0x5c, 0x5c, 0x5d, 0x5d, 0x5d, 0x5e, 0x5e, 0x5f,
    0x5f, 0x60, 0x60, 0x61, 0x61, 0x62, 0x62, 0x62, /* 159 */
    0x62, 0x63, 0x64, 0x64, 0x64, 0x64, 0x65, 0x66,
    0x66, 0x66, 0x67, 0x67, 0x67, 0x67, 0x68, 0x68, /* 175 */
    0x68, 0x69, 0x69, 0x69, 0x6a, 0x6a, 0x6a, 0x6b,
    0x6b, 0x6b, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, /* 191 */
    0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0x70, 0x71,
    0x72, 0x73, 0x74, 0x75, 0xff, 0xff, 0xff, 0xff, /* 207 */
    0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0x80, 0x80,
    0x80, 0x80, 0x81, 0x81, 0x81, 0x81, 0x82, 0x82, /* 223 */
    0x82, 0x82, 0x83, 0x83, 0x83, 0x83, 0xff, 0xff,
    0xff, 0xff, 0x85, 0x85, 0x85, 0x85, 0x86, 0x86, /* 239 */
    0x86, 0x86, 0xff, 0xff, 0xff, 0xff, 0x88, 0x89,
    0x8a, 0x8b, 0x8c, 0x8d, 0x8e, 0x8f, 0x90, 0x91, /* 255 */
};

/*
 * Level triggerd IRQ list
 * Not listed IRQ is Edge trigger.
 * See "11.3.1 Interrupt Vector Table" in hardware manual.
 */
static const uint8_t levelirq[] = {
     16,  21,  32,  44,  47,  48,  51,  64,  65,  66,
     67,  68,  69,  70,  71,  72,  73,  74,  75,  76,
     77,  78,  79,  90,  91, 170, 171, 172, 173, 214,
    217, 218, 221, 222, 225, 226, 229, 234, 237, 238,
    241, 246, 249, 250, 253,
};

static void register_icu(RX24TState *s)
{
    int i;
    SysBusDevice *icu;

    object_initialize_child(OBJECT(s), "icu", &s->icu, TYPE_RX_ICU);
    icu = SYS_BUS_DEVICE(&s->icu);
    qdev_prop_set_uint32(DEVICE(icu), "len-ipr-map", NR_IRQS);
    for (i = 0; i < NR_IRQS; i++) {
        char propname[32];
        snprintf(propname, sizeof(propname), "ipr-map[%d]", i);
        qdev_prop_set_uint32(DEVICE(icu), propname, ipr_table[i]);
    }
    qdev_prop_set_uint32(DEVICE(icu), "len-trigger-level",
                         ARRAY_SIZE(levelirq));
    for (i = 0; i < ARRAY_SIZE(levelirq); i++) {
        char propname[32];
        snprintf(propname, sizeof(propname), "trigger-level[%d]", i);
        qdev_prop_set_uint32(DEVICE(icu), propname, levelirq[i]);
    }

    for (i = 0; i < NR_IRQS; i++) {
        s->irq[i] = qdev_get_gpio_in(DEVICE(icu), i);
    }
    sysbus_realize(icu, &error_abort);
    sysbus_connect_irq(icu, 0, qdev_get_gpio_in(DEVICE(&s->cpu), RX_CPU_IRQ));
    sysbus_connect_irq(icu, 1, qdev_get_gpio_in(DEVICE(&s->cpu), RX_CPU_FIR));
    sysbus_connect_irq(icu, 2, s->irq[SWI]);
    sysbus_mmio_map(SYS_BUS_DEVICE(icu), 0, RX24T_ICU_BASE);
}

static void register_tmr(RX24TState *s, int unit)
{
    SysBusDevice *tmr;
    int i, irqbase;

    object_initialize_child(OBJECT(s), "tmr[*]",
                            &s->tmr[unit], TYPE_RENESAS_TMR);
    tmr = SYS_BUS_DEVICE(&s->tmr[unit]);
    qdev_prop_set_uint64(DEVICE(tmr), "input-freq", s->pclk_freq_hz);
    sysbus_realize(tmr, &error_abort);

    irqbase = RX24T_TMR_IRQ + TMR_NR_IRQ * unit;
    for (i = 0; i < TMR_NR_IRQ; i++) {
        sysbus_connect_irq(tmr, i, s->irq[irqbase + i]);
    }
    sysbus_mmio_map(tmr, 0, RX24T_TMR_BASE + unit * 0x10);
}

static void register_cmt(RX24TState *s, int unit)
{
    SysBusDevice *cmt;
    int i, irqbase;

    object_initialize_child(OBJECT(s), "cmt[*]",
                            &s->cmt[unit], TYPE_RENESAS_CMT);
    cmt = SYS_BUS_DEVICE(&s->cmt[unit]);
    qdev_prop_set_uint64(DEVICE(cmt), "input-freq", s->pclk_freq_hz);
    sysbus_realize(cmt, &error_abort);

    irqbase = RX24T_CMT_IRQ + CMT_NR_IRQ * unit;
    for (i = 0; i < CMT_NR_IRQ; i++) {
        sysbus_connect_irq(cmt, i, s->irq[irqbase + i]);
    }
    sysbus_mmio_map(cmt, 0, RX24T_CMT_BASE + unit * 0x10);
}

static void register_sci(RX24TState *s, int unit)
{
    SysBusDevice *sci;
    int i, irqbase;

    object_initialize_child(OBJECT(s), "sci[*]",
                            &s->sci[unit], TYPE_RENESAS_SCI);
    sci = SYS_BUS_DEVICE(&s->sci[unit]);
    qdev_prop_set_chr(DEVICE(sci), "chardev", serial_hd(unit));
    qdev_prop_set_uint64(DEVICE(sci), "input-freq", s->pclk_freq_hz);
    sysbus_realize(sci, &error_abort);

    irqbase = RX24T_SCI_IRQ + SCI_NR_IRQ * unit;
    for (i = 0; i < SCI_NR_IRQ; i++) {
        sysbus_connect_irq(sci, i, s->irq[irqbase + i]);
    }
    sysbus_mmio_map(sci, 0, RX24T_SCI_BASE + unit * 0x08);
}

static void register_mtu0(RX24TState *s, int unit)
{
    SysBusDevice *mtu0;
    int i, irqbase;

    object_initialize_child(OBJECT(s), "mtu0", 
							&s->mtu0, TYPE_RENESAS_MTU0);

    mtu0 = SYS_BUS_DEVICE(&s->mtu0);
    qdev_prop_set_uint64(DEVICE(mtu0), "input-freq", RX24T_PCLK);
    sysbus_realize(mtu0, &error_abort);

    irqbase = RX62T_MTU0_IRQBASE;
    for (i = 0; i < MTU0_NR_IRQ; i++) {
        sysbus_connect_irq(mtu0, i, s->irq[irqbase + i]);
    }
    sysbus_mmio_map(mtu0, 0, RX24T_MTU0BASE);

}

static void register_mtu1(RX24TState *s, int unit)
{
    SysBusDevice *mtu1;
    int i, irqbase;

    object_initialize_child(OBJECT(s), "mtu1", 
							&s->mtu1, TYPE_RENESAS_MTU1);

    mtu1 = SYS_BUS_DEVICE(&s->mtu1);
    qdev_prop_set_uint64(DEVICE(mtu1), "input-freq", RX24T_PCLK);
    sysbus_realize(mtu1, &error_abort);

    irqbase = RX62T_MTU1_IRQBASE;
    for (i = 0; i < MTU1_NR_IRQ; i++) {
        sysbus_connect_irq(mtu1, i, s->irq[irqbase + i]);
    }
    sysbus_mmio_map(mtu1, 0, RX24T_MTU1BASE);

}

static void register_mtu2(RX24TState *s, int unit)
{
    SysBusDevice *mtu2;
    int i, irqbase;

    object_initialize_child(OBJECT(s), "mtu2", 
							&s->mtu2, TYPE_RENESAS_MTU2);

    mtu2 = SYS_BUS_DEVICE(&s->mtu2);
    qdev_prop_set_uint64(DEVICE(mtu2), "input-freq", RX24T_PCLK);
    sysbus_realize(mtu2, &error_abort);

    irqbase = RX62T_MTU2_IRQBASE;
    for (i = 0; i < MTU2_NR_IRQ; i++) {
        sysbus_connect_irq(mtu2, i, s->irq[irqbase + i]);
    }
    sysbus_mmio_map(mtu2, 0, RX24T_MTU2BASE);
}


static void register_mtu34(RX24TState *s, int unit)
{
    SysBusDevice *mtu34;
    int i, irqbase;

    object_initialize_child(OBJECT(s), "mtu34", 
							&s->mtu34, TYPE_RENESAS_MTU34);

    mtu34 = SYS_BUS_DEVICE(&s->mtu34);
    qdev_prop_set_uint64(DEVICE(mtu34), "input-freq", RX24T_PCLK);
    sysbus_realize(mtu34, &error_abort);

    irqbase = RX62T_MTU34_IRQBASE;
    for (i = 0; i < MTU34_NR_IRQ; i++) {
        sysbus_connect_irq(mtu34, i, s->irq[irqbase + i]);
    }
    sysbus_mmio_map(mtu34, 0, RX24T_MTU34BASE);

}

static void register_s12ad(RX24TState *s, int unit)
{
    SysBusDevice *s12ad;
    int i, irqbase;

    object_initialize_child(OBJECT(s), "s12ad", 
							&s->s12ad, TYPE_RENESAS_S12AD);

    s12ad = SYS_BUS_DEVICE(&s->s12ad);
    qdev_prop_set_uint64(DEVICE(s12ad), "input-freq", RX24T_PCLK);
    sysbus_realize(s12ad, &error_abort);

    irqbase = RX62T_S12AD_IRQBASE;
    for (i = 0; i < S12AD_NR_IRQ; i++) {
        sysbus_connect_irq(s12ad, i, s->irq[irqbase + i]);
    }
    sysbus_mmio_map(s12ad, 0, RX24T_S12ADBASE);
}

static void register_system(RX24TState *s, int unit)
{
    SysBusDevice *system;

    object_initialize_child(OBJECT(s), "system", 
							&s->system, TYPE_RENESAS_SYSTEM);

    system = SYS_BUS_DEVICE(&s->system);
    qdev_prop_set_uint64(DEVICE(system), "input-freq", RX24T_PCLK);
    sysbus_realize(system, &error_abort);

    sysbus_mmio_map(system, 0, RX24T_SYSTEM_BASE);
}

static void register_ioport(RX24TState *s, int unit)
{
    SysBusDevice *ioport;

    object_initialize_child(OBJECT(s), "ioport", 
							&s->ioport, TYPE_RENESAS_IOPORT);

    ioport = SYS_BUS_DEVICE(&s->ioport);
    qdev_prop_set_uint64(DEVICE(ioport), "input-freq", RX24T_PCLK);
    sysbus_realize(ioport, &error_abort);

    sysbus_mmio_map(ioport, 0, RX24T_IOPORTBASE);
}


static void register_keytest(RX24TState *s, int unit)
{
    SysBusDevice *keytest;
  
    object_initialize_child(OBJECT(s), "keytest", 
							&s->keytest, TYPE_RENESAS_KEYTEST);

    keytest = SYS_BUS_DEVICE(&s->keytest);
    sysbus_realize(keytest, &error_abort);

    sysbus_mmio_map(keytest, 0, RX24T_KEYTESTBASE);
}


static void rx24t_realize(DeviceState *dev, Error **errp)
{
    RX24TState *s = RX24T_MCU(dev);
    RX24TClass *rxc = RX24T_MCU_GET_CLASS(dev);

    if (s->xtal_freq_hz == 0) {
        error_setg(errp, "\"xtal-frequency-hz\" property must be provided.");
        return;
    }
    /* XTAL range: 8-14 MHz */
    if (s->xtal_freq_hz < RX24T_XTAL_MIN_HZ
            || s->xtal_freq_hz > RX24T_XTAL_MAX_HZ) {
        error_setg(errp, "\"xtal-frequency-hz\" property in incorrect range.");
        return;
    }
    /* Use a 4x fixed multiplier */
    s->pclk_freq_hz = 4 * s->xtal_freq_hz;
    /* PCLK range: 8-50 MHz */
    assert(s->pclk_freq_hz <= RX24T_PCLK_MAX_HZ);

    memory_region_init_ram(&s->iram, OBJECT(dev), "iram",
                           rxc->ram_size, &error_abort);
    memory_region_add_subregion(s->sysmem, RX24T_IRAM_BASE, &s->iram);
    memory_region_init_rom(&s->d_flash, OBJECT(dev), "flash-data",
                           rxc->data_flash_size, &error_abort);
    memory_region_add_subregion(s->sysmem, RX24T_DFLASH_BASE, &s->d_flash);
    memory_region_init_rom(&s->c_flash, OBJECT(dev), "flash-code",
                           rxc->rom_flash_size, &error_abort);
    memory_region_add_subregion(s->sysmem, RX24T_CFLASH_BASE, &s->c_flash);

    /* Initialize CPU */
    object_initialize_child(OBJECT(s), "cpu", &s->cpu, TYPE_RX62N_CPU);
    qdev_realize(DEVICE(&s->cpu), NULL, &error_abort);

    register_icu(s);
    s->cpu.env.ack = qdev_get_gpio_in_named(DEVICE(&s->icu), "ack", 0);
    register_tmr(s, 0);
    register_tmr(s, 1);
    register_cmt(s, 0);
    register_cmt(s, 1);
    register_sci(s, 0);
    register_mtu0(s, 0);
    register_mtu1(s, 0);
    register_mtu2(s, 0);
    register_mtu34(s, 0);
    register_s12ad(s, 0);
    register_system(s, 0);
    register_ioport(s, 0);
    register_keytest(s, 0);
    

}

static Property rx24t_properties[] = {
    DEFINE_PROP_LINK("main-bus", RX24TState, sysmem, TYPE_MEMORY_REGION,
                     MemoryRegion *),
    DEFINE_PROP_BOOL("load-kernel", RX24TState, kernel, false),
    DEFINE_PROP_UINT32("xtal-frequency-hz", RX24TState, xtal_freq_hz, 0),
    DEFINE_PROP_END_OF_LIST(),
};

static void rx24t_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = rx24t_realize;
    device_class_set_props(dc, rx24t_properties);
}

static void r5f524taadfp_class_init(ObjectClass *oc, void *data)
{
    RX24TClass *rxc = RX24T_MCU_CLASS(oc);

    rxc->ram_size = 96 * KiB;
    rxc->rom_flash_size = 512 * KiB;
    rxc->data_flash_size = 8 * KiB;
};

static const TypeInfo rx24t_types[] = {
	{
        .name           = TYPE_R5F524TAADFP_MCU,
        .parent         = TYPE_RX24T_MCU,
        .class_init     = r5f524taadfp_class_init,
    }, {
        .name           = TYPE_RX24T_MCU,
        .parent         = TYPE_DEVICE,
        .instance_size  = sizeof(RX24TState),
        .class_size     = sizeof(RX24TClass),
        .class_init     = rx24t_class_init,
        .abstract       = true,
     }
};

DEFINE_TYPES(rx24t_types)
